Revit 2024 API
BuiltInFailures.FamilyFailures.CannotCopyByPatternFamilies Property
 Can't copy between Mass or Curtain Panel by Pattern families, and other families or Revit projects.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotCopyByPatternFamilies { get; }
Visual Basic
Public Shared ReadOnly Property CannotCopyByPatternFamilies As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotCopyByPatternFamilies {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.FamilyFailures Class
Autodesk.Revit.DB Namespace